tap "beeftornado/rmtree"
tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "cloudflare/cloudflare"
tap "cmacrae/formulae"
tap "crisidev/chunkwm"
tap "d12frosted/emacs-plus"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "mananapr/cfiles"
tap "xwmx/taps"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Install pip packages as homebrew formulae
brew "brew-pip"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Migemo is a tool that supports Japanese incremental search with Romaji
brew "cmigemo"
# Reimplementation of ctags(1)
brew "ctags", link: false
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GitHub Markdown previewer
brew "grip", link: false
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Dead simple terminal plots from JSON data
brew "jp"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Collection of PostScript document handling utilities
brew "psutils"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Generic syntax highlighter
brew "pygments", link: false
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Manipulate and query tags on macOS files
brew "tag"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Converts a ttyrec file into gif files
brew "ttygif"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
brew "beeftornado/rmtree/brew-rmtree"
# Recursively search directories for a regex pattern.
brew "burntsushi/ripgrep/ripgrep-bin"
# Argo Tunnel
brew "cloudflare/cloudflare/cloudflared"
# A minimal status bar for macOS.
brew "cmacrae/formulae/spacebar"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
# It's like cat(1), but for images.
brew "eddieantonio/eddieantonio/imgcat"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Create and modify subtitles
cask "aegisub"
# Rule-based custom proxy with GUI based on clash
cask "clashx"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Tool to hide status bar icons
cask "dozer"
# QuickLook generator and Spotlight importer
cask "epubquicklook"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Retro video game emulation
cask "openemu"
# Peer to peer Bitorrent client
cask "qbittorrent"
cask "qladdict"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlmobi"
cask "qlstephen"
cask "quicklook-json"
